yong1214/qemu-esp32/hw/i2c/esp32_i2c_devices.c
/**
 * ESP32 I2C Virtual Device Implementation
 * 
 * Device-specific, encapsulated implementation for Phase 8 Virtual Device Integration
 * Provides professional-grade device simulation with hardware-accurate behavior
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/i2c/esp32_i2c_devices.h"
#include "hw/i2c/device_set.h"
#include "hw/i2c/devices/tmp105_vdev.h"
#include <stdio.h>

/* Dump SSD1306 display buffer to stderr for backend parsing */
static void ssd1306_dump_display_buffer(SSD1306Device *device)
{
    /* Output format: OLED_BUFFER:<1024 hex bytes>\n */
    fprintf(stderr, "OLED_BUFFER:");
    for (int i = 0; i < (int)sizeof(device->display_buffer); i++) {
        fprintf(stderr, "%02x", device->display_buffer[i]);
    }
    fprintf(stderr, "\n");
    fflush(stderr);
}

/* Phase 8: TMP105 Temperature Sensor Implementation */

void tmp105_init(TMP105Device *device, uint8_t address, float initial_temperature)
{
    // Initialize base structure
    device->base.address = address;
    device->base.type = I2C_DEVICE_TYPE_TMP105;
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.present = true;
    device->base.responding = true;
    device->base.last_access_time = 0;
    device->base.access_count = 0;
    device->base.debug_enabled = true;
    
    // Initialize TMP105-specific fields
    device->temperature = initial_temperature;
    device->config_register = 0x00;  // Default configuration
    device->resolution = 12;         // 12-bit resolution
    device->register_address = 0x00; // Temperature register
    device->shutdown_mode = false;
    device->conversion_time_us = 100; // 100μs conversion time
    device->read_phase = 0;           // start with MSB on reads
    device->drift_c_per_sec = 0.0;    // no drift by default
    device->noise_c_amplitude = 0.25; // +-0.25C random noise per conversion
    device->temp_min_c = -40.0f;
    device->temp_max_c = 125.0f;
    device->last_conversion_time_ns = 0;
    
    if (device->base.debug_enabled) {
        qemu_log("esp32_i2c: TMP105 initialized at 0x%02x (%.2f°C)\n", address, initial_temperature);
    }
}

void tmp105_reset(TMP105Device *device)
{
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.responding = true;
    device->config_register = 0x00;
    device->register_address = 0x00;
    device->shutdown_mode = false;
    device->base.access_count = 0;
    device->read_phase = 0;
    device->last_conversion_time_ns = 0;
    
    if (device->base.debug_enabled) {
        qemu_log("esp32_i2c: TMP105 reset at 0x%02x\n", device->base.address);
    }
}

void tmp105_process_read(TMP105Device *device, uint8_t *data, size_t length)
{
    if (!device->base.responding || length == 0) {
        return;
    }
    
    // Minimal environment simulation: update temperature on conversion cadence
    uint64_t now_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    if (device->last_conversion_time_ns == 0) {
        device->last_conversion_time_ns = now_ns;
    }
    uint64_t elapsed_ns = now_ns - device->last_conversion_time_ns;
    uint64_t period_ns = (uint64_t)device->conversion_time_us * 1000ULL;
    if (elapsed_ns >= period_ns) {
        double dt_s = (double)elapsed_ns / 1e9;
        double noise = 0.0;
        // GLib RNG is available via qemu/osdep.h
        noise = g_random_double_range(-device->noise_c_amplitude, device->noise_c_amplitude);
        double updated = (double)device->temperature + device->drift_c_per_sec * dt_s + noise;
        if (updated < (double)device->temp_min_c) updated = (double)device->temp_min_c;
        if (updated > (double)device->temp_max_c) updated = (double)device->temp_max_c;
        device->temperature = (float)updated;
        device->last_conversion_time_ns = now_ns;
        qemu_log("esp32_i2c: Phase 8 - TMP105 temp update -> %.2fC (dt=%.3fs, noise=%.2fC)\n",
                 device->temperature, dt_s, noise);
    }
    
    // TMP105 temperature reading (12-bit format)
    if (device->register_address == 0x00) {  // Temperature register
        // Convert temperature to TMP105 12-bit format
        int16_t raw_temp = (int16_t)(device->temperature * 16.0);  // 0.0625°C resolution
        
        // Handle negative temperatures (2's complement)
        if (raw_temp < 0) {
            raw_temp = raw_temp + 4096;  // Convert to unsigned 12-bit
        }
        uint8_t msb = (raw_temp >> 4) & 0xFF;  // MSB
        uint8_t lsb = (raw_temp << 4) & 0xF0;  // LSB (4 bits)
        if (length >= 2) {
            data[0] = msb;
            data[1] = lsb;
            device->read_phase = 0; // reset phase after fulfilling full word
        } else { // length == 1
            if (device->read_phase == 0) {
                data[0] = msb;
                device->read_phase = 1;
            } else {
                data[0] = lsb;
                device->read_phase = 0;
            }
        }
        
        device->base.access_count++;
        device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
        
        if (length >= 2) {
        if (device->base.debug_enabled) {
            qemu_log("esp32_i2c: TMP105 temperature read: %.2f°C (0x%02x%02x)\n",
                     device->temperature, data[0], data[1]);
        }
        } else {
            qemu_log("esp32_i2c: Phase 8 - TMP105 temperature read: %.2f°C (byte=%02x phase=%d)\n",
                     device->temperature, data[0], device->read_phase);
        }
    } else if (device->register_address == 0x01) {  // Configuration register
        if (length >= 2) {
            data[0] = device->config_register;
            data[1] = 0x00;  // Reserved bits
        } else {
            data[0] = device->config_register;
        }
        
        qemu_log("esp32_i2c: Phase 8 - TMP105 config read: 0x%02x\n", device->config_register);
    }
}

void tmp105_process_write(TMP105Device *device, uint8_t *data, size_t length)
{
    if (!device->base.responding || length == 0) {
        return;
    }
    
    // First byte is usually the register address
    if (length == 1) {
        device->register_address = data[0];
        device->base.state = I2C_DEVICE_STATE_ADDRESSED;
        device->read_phase = 0; // reset read phase on new pointer
        
        qemu_log("esp32_i2c: Phase 8 - TMP105 register selected: 0x%02x\n", device->register_address);
    } else if (length == 2 && device->register_address == 0x01) {  // Configuration register
        device->config_register = data[0];
        device->shutdown_mode = (data[0] & 0x01) != 0;  // Shutdown bit
        
