yong1214/qemu-esp32/hw/i2c/esp32_i2c_devices.c
        if (device->base.debug_enabled) {
            qemu_log("esp32_i2c: TMP105 config written: 0x%02x (shutdown=%d)\n",
                     device->config_register, device->shutdown_mode);
        }
    }
    
    device->base.access_count++;
    device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
}

bool tmp105_handle_register_access(TMP105Device *device, uint8_t register_addr, bool is_write)
{
    if (register_addr == 0x00 || register_addr == 0x01) {
        device->register_address = register_addr;
        device->base.state = is_write ? I2C_DEVICE_STATE_WRITING : I2C_DEVICE_STATE_READING;
        return true;
    }
    return false;
}

void tmp105_update_temperature(TMP105Device *device, float new_temperature)
{
    device->temperature = new_temperature;
    qemu_log("esp32_i2c: Phase 8 - TMP105 temperature updated: %.2f°C\n", new_temperature);
}

void tmp105_log_event(TMP105Device *device, const char *event)
{
    qemu_log("esp32_i2c: Phase 8 - TMP105 0x%02x %s (State: %d, Access: %d)\n",
             device->base.address, event, device->base.state, device->base.access_count);
}

/* Phase 8: EEPROM Memory Device Implementation */

void eeprom_init(EEPROMDevice *device, uint8_t address, size_t memory_size)
{
    // Initialize base structure
    device->base.address = address;
    device->base.type = I2C_DEVICE_TYPE_EEPROM;
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.present = true;
    device->base.responding = true;
    device->base.last_access_time = 0;
    device->base.access_count = 0;
    device->base.debug_enabled = true;
    
    // Initialize EEPROM-specific fields
    memset(device->memory, 0xFF, sizeof(device->memory));  // EEPROM defaults to 0xFF
    device->current_address = 0;
    device->write_protect = 0;
    device->write_cycles = 0;
    device->page_size = 64;  // 64-byte pages
    device->address_bytes = 2;  // 2-byte addressing
    device->write_delay_ms = 5;  // 5ms write delay
    
    qemu_log("esp32_i2c: Phase 8 - EEPROM initialized at 0x%02x (%zu bytes)\n", 
             address, memory_size);
}

void eeprom_reset(EEPROMDevice *device)
{
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.responding = true;
    device->current_address = 0;
    device->write_protect = 0;
    device->base.access_count = 0;
    
    qemu_log("esp32_i2c: Phase 8 - EEPROM reset at 0x%02x\n", device->base.address);
}

void eeprom_process_read(EEPROMDevice *device, uint8_t *data, size_t length)
{
    if (!device->base.responding) {
        return;
    }
    
    for (size_t i = 0; i < length && device->current_address < sizeof(device->memory); i++) {
        data[i] = device->memory[device->current_address++];
    }
    
    device->base.access_count++;
    device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    
    qemu_log("esp32_i2c: Phase 8 - EEPROM read %zu bytes from 0x%04x\n", 
             length, device->current_address - length);
}

void eeprom_process_write(EEPROMDevice *device, uint8_t *data, size_t length)
{
    if (!device->base.responding || device->write_protect) {
        return;
    }
    
    // First 2 bytes are usually the address
    if (length >= 2) {
        device->current_address = (data[0] << 8) | data[1];
        data += 2;
        length -= 2;
        
        // Write data to memory
        for (size_t i = 0; i < length && device->current_address < sizeof(device->memory); i++) {
            device->memory[device->current_address++] = data[i];
        }
        
        device->write_cycles++;
        device->base.access_count++;
        device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
        
        qemu_log("esp32_i2c: Phase 8 - EEPROM write %zu bytes to 0x%04x (cycles: %d)\n",
                 length, device->current_address - length, device->write_cycles);
    }
}

bool eeprom_handle_address_write(EEPROMDevice *device, uint8_t *address_data, size_t length)
{
    if (length >= 2) {
        device->current_address = (address_data[0] << 8) | address_data[1];
        device->base.state = I2C_DEVICE_STATE_ADDRESSED;
        return true;
    }
    return false;
}

void eeprom_write_page(EEPROMDevice *device, uint16_t address, uint8_t *data, size_t length)
{
    if (device->write_protect) {
        return;
    }
    
    size_t page_start = (address / device->page_size) * device->page_size;
    size_t page_end = page_start + device->page_size;
    
    for (size_t i = 0; i < length && (address + i) < page_end; i++) {
        device->memory[address + i] = data[i];
    }
    
    device->write_cycles++;
    qemu_log("esp32_i2c: Phase 8 - EEPROM page write to 0x%04x (%zu bytes)\n", address, length);
}

void eeprom_log_event(EEPROMDevice *device, const char *event)
{
    qemu_log("esp32_i2c: Phase 8 - EEPROM 0x%02x %s (State: %d, Cycles: %d)\n",
             device->base.address, event, device->base.state, device->write_cycles);
}

/* Phase 8: RTC Real-Time Clock Implementation */

void rtc_init(RTCDevice *device, uint8_t address)
{
    // Initialize base structure
    device->base.address = address;
    device->base.type = I2C_DEVICE_TYPE_RTC;
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.present = true;
    device->base.responding = true;
    device->base.last_access_time = 0;
    device->base.access_count = 0;
    device->base.debug_enabled = true;
    
    // Initialize RTC-specific fields (default time)
    device->seconds = 0x00;  // BCD format
    device->minutes = 0x00;
    device->hours = 0x12;    // 12:00:00
    device->day = 0x01;
    device->month = 0x01;
    device->year = 0x24;     // 2024
    device->control_register = 0x00;
    device->register_address = 0x00;
    device->alarm_enabled = false;
    device->oscillator_enabled = true;
    
    qemu_log("esp32_i2c: Phase 8 - RTC initialized at 0x%02x\n", address);
}

void rtc_reset(RTCDevice *device)
{
    device->base.state = I2C_DEVICE_STATE_IDLE;
    device->base.responding = true;
    device->control_register = 0x00;
    device->register_address = 0x00;
    device->alarm_enabled = false;
    device->oscillator_enabled = true;
    device->base.access_count = 0;
    
    qemu_log("esp32_i2c: Phase 8 - RTC reset at 0x%02x\n", device->base.address);
}

void rtc_process_read(RTCDevice *device, uint8_t *data, size_t length)
{
    if (!device->base.responding) {
        return;
    }
    
    // RTC register reading (BCD format)
    switch (device->register_address) {
    case 0x00:  // Seconds
        data[0] = device->seconds;
        break;
    case 0x01:  // Minutes
        data[0] = device->minutes;
        break;
    case 0x02:  // Hours
        data[0] = device->hours;
        break;
    case 0x03:  // Day
        data[0] = device->day;
        break;
    case 0x04:  // Month
        data[0] = device->month;
        break;
    case 0x05:  // Year
        data[0] = device->year;
        break;
    case 0x07:  // Control register
        data[0] = device->control_register;
        break;
    default:
        data[0] = 0x00;
        break;
    }
    
    device->base.access_count++;
    device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    
    qemu_log("esp32_i2c: Phase 8 - RTC read register 0x%02x: 0x%02x\n",
             device->register_address, data[0]);
}

