yong1214/qemu-esp32/hw/i2c/esp32_i2c_devices.c
void ssd1306_set_pixel(SSD1306Device *device, uint8_t x, uint8_t y, bool on)
{
    if (x < 128 && y < 64) {
        size_t buffer_index = (y / 8) * 128 + x;
        if (buffer_index < sizeof(device->display_buffer)) {
            if (on) {
                device->display_buffer[buffer_index] |= (1 << (y % 8));
            } else {
                device->display_buffer[buffer_index] &= ~(1 << (y % 8));
            }
        }
    }
}

void ssd1306_log_event(SSD1306Device *device, const char *event)
{
    qemu_log("esp32_i2c: Phase 8 - SSD1306 0x%02x %s (State: %d, Display: %s)\n",
             device->base.address, event, device->base.state,
             device->display_on ? "ON" : "OFF");
}

/* Phase 8: Generic Device Management Implementation */

I2CVirtualDevice* esp32_i2c_find_device_by_address(Esp32I2CState *s, uint8_t address)
{
    for (int i = 0; i < s->device_count; i++) {
        if (s->virtual_devices[i].base.address == address) {
            return &s->virtual_devices[i];
        }
    }
    return NULL;
}

I2CVirtualDevice* esp32_i2c_find_device_by_type(Esp32I2CState *s, I2CVirtualDeviceType type)
{
    for (int i = 0; i < s->device_count; i++) {
        if (s->virtual_devices[i].base.type == type) {
            return &s->virtual_devices[i];
        }
    }
    return NULL;
}

bool esp32_i2c_add_device(Esp32I2CState *s, I2CVirtualDevice *device)
{
    if (s->device_count >= I2C_MAX_VIRTUAL_DEVICES) {
        return false;
    }
    
    s->virtual_devices[s->device_count] = *device;
    s->device_count++;
    
    qemu_log("esp32_i2c: Phase 8 - Device added: %s at 0x%02x\n",
             esp32_i2c_get_device_type_name(device->base.type), device->base.address);
    return true;
}

bool esp32_i2c_remove_device(Esp32I2CState *s, uint8_t address)
{
    for (int i = 0; i < s->device_count; i++) {
        if (s->virtual_devices[i].base.address == address) {
            // Shift remaining devices
            for (int j = i; j < s->device_count - 1; j++) {
                s->virtual_devices[j] = s->virtual_devices[j + 1];
            }
            s->device_count--;
            
            qemu_log("esp32_i2c: Phase 8 - Device removed: 0x%02x\n", address);
            return true;
        }
    }
    return false;
}

void esp32_i2c_scan_devices(Esp32I2CState *s)
{
    qemu_log("esp32_i2c: Phase 8 - Device scan: Found %d devices\n", s->device_count);
    
    for (int i = 0; i < s->device_count; i++) {
        I2CVirtualDevice *device = &s->virtual_devices[i];
        qemu_log("esp32_i2c: Phase 8 - Device %d: %s at 0x%02x (State: %s, Access: %d)\n",
                 i, esp32_i2c_get_device_type_name(device->base.type),
                 device->base.address, esp32_i2c_get_device_state_name(device->base.state),
                 device->base.access_count);
    }
}

void esp32_i2c_log_device_event(I2CVirtualDevice *device, const char *event)
{
    qemu_log("esp32_i2c: Phase 8 - %s 0x%02x %s (State: %s, Access: %d)\n",
             esp32_i2c_get_device_type_name(device->base.type), device->base.address, event,
             esp32_i2c_get_device_state_name(device->base.state), device->base.access_count);
}

/* Phase 8: Device Response Simulation Implementation */

bool esp32_i2c_simulate_device_ack(Esp32I2CState *s, uint8_t device_address)
{
    if (s->vdev_i2c_set) {
        const I2CDeviceEntry *e = i2c_device_set_find(s->vdev_i2c_set, device_address);
        if (e && e->ops && e->ops->i2c_can_ack) {
            return e->ops->i2c_can_ack(e->device, device_address, false);
        }
    }
    I2CVirtualDevice *device = esp32_i2c_find_device_by_address(s, device_address);
    if (!device || !device->base.responding) {
        return false;
    }
    
    // Simulate device-specific ACK behavior
    switch (device->base.type) {
    case I2C_DEVICE_TYPE_TMP105:
        return !((TMP105Device*)device)->shutdown_mode;
    case I2C_DEVICE_TYPE_EEPROM:
        return !((EEPROMDevice*)device)->write_protect;
    case I2C_DEVICE_TYPE_RTC:
        return ((RTCDevice*)device)->oscillator_enabled;
    case I2C_DEVICE_TYPE_SSD1306:
        return true;  // Always responds
    default:
        return true;
    }
}

void esp32_i2c_simulate_device_data(Esp32I2CState *s, uint8_t device_address, uint8_t *data, size_t length)
{
    if (s->vdev_i2c_set) {
        const I2CDeviceEntry *e = i2c_device_set_find(s->vdev_i2c_set, device_address);
        if (e && e->ops && e->ops->i2c_read) {
            if (e->ops->i2c_on_addressed) e->ops->i2c_on_addressed(e->device, device_address, true);
            ssize_t n = e->ops->i2c_read(e->device, device_address, data, length);
            if (n > 0 && (size_t)n < length) memset(data + n, 0x00, length - (size_t)n);
            if (n <= 0) memset(data, 0x00, length);
            return;
        }
    }
    I2CVirtualDevice *device = esp32_i2c_find_device_by_address(s, device_address);
    if (!device || !device->base.responding) {
        return;
    }
    
    // Call device-specific read function
    switch (device->base.type) {
    case I2C_DEVICE_TYPE_TMP105:
        tmp105_process_read((TMP105Device*)device, data, length);
        break;
    case I2C_DEVICE_TYPE_EEPROM:
        eeprom_process_read((EEPROMDevice*)device, data, length);
        break;
    case I2C_DEVICE_TYPE_RTC:
        rtc_process_read((RTCDevice*)device, data, length);
        break;
    case I2C_DEVICE_TYPE_SSD1306:
        ssd1306_process_read((SSD1306Device*)device, data, length);
        break;
    case I2C_DEVICE_TYPE_UNKNOWN:
    default:
        // Unknown device type - send zeros
        memset(data, 0x00, length);
        break;
    }
}

void esp32_i2c_handle_device_response(Esp32I2CState *s, uint8_t device_address)
{
    I2CVirtualDevice *device = esp32_i2c_find_device_by_address(s, device_address);
    if (!device) {
        return;
    }
    
    device->base.state = I2C_DEVICE_STATE_ADDRESSED;
    device->base.access_count++;
    device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);

    if (device->base.type == I2C_DEVICE_TYPE_TMP105) {
        ((TMP105Device*)device)->read_phase = 0; // start MSB on next read window
    }
    
    if (s->device_debug_enabled) {
        qemu_log("esp32_i2c: Device 0x%02x addressed (Type: %s)\n",
                 device_address, esp32_i2c_get_device_type_name(device->base.type));
    }
}

/* Phase 8: Helper Functions Implementation */

const char* esp32_i2c_get_device_type_name(I2CVirtualDeviceType type)
{
    static const char* names[] = {
        "TMP105", "EEPROM", "RTC", "SSD1306", "UNKNOWN"
    };
    
    if (type < I2C_DEVICE_TYPE_UNKNOWN) {
        return names[type];
    }
    return names[I2C_DEVICE_TYPE_UNKNOWN];
}

const char* esp32_i2c_get_device_state_name(I2CVirtualDeviceState state)
{
    static const char* names[] = {
        "IDLE", "ADDRESSED", "READING", "WRITING", "ERROR"
    };
    
    if (state <= I2C_DEVICE_STATE_ERROR) {
        return names[state];
    }
    return "UNKNOWN";
}

void esp32_i2c_update_device_access_time(I2CVirtualDevice *device)
{
    device->base.last_access_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    device->base.access_count++;
}

bool esp32_i2c_is_device_responding(I2CVirtualDevice *device)
{
    return device && device->base.responding && device->base.present;
}
